{
  "backend/main.mo": "Motoko backend implementing user and vendor profile management, menu CRUD, authorization checks, and vendor listing sorted by location.",
  "feature_evidence.json": "Feature evidence report mapping features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file for documentation or planning.",
  "frontend/index.css": "Tailwind base styles defining color tokens, dark mode variables, and global layout rules.",
  "frontend/index.html": "HTML entry point providing the root container and loading the main React script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for landing, customer, and vendor pages with AppLayout.",
  "frontend/src/components/AppLayout.tsx": "Main layout with navigation, Internet Identity auth handling, and responsive mobile menu.",
  "frontend/src/components/auth/AuthGate.tsx": "Login gate prompting users to authenticate via Internet Identity before accessing protected views.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting users to enter their name and vendor status, then saves the profile via mutation.",
  "frontend/src/components/auth/VendorGate.tsx": "Restricts access to vendor-only areas by checking the user profile and showing setup or error states as needed.",
  "frontend/src/components/customer/CustomerBrowseView.tsx": "Displays vendor search, filters, a list, and a map, handling loading, empty, and error states.",
  "frontend/src/components/customer/VendorDetailPanel.tsx": "Slide-out panel showing detailed vendor info including contact, location, and menu with availability.",
  "frontend/src/components/customer/VendorList.tsx": "Scrollable list of vendors with basic info, highlighting the selected vendor and item availability.",
  "frontend/src/components/map/OsmVendorMap.tsx": "Initializes a Leaflet map, loads markers for vendors, and updates selection on marker click.",
  "frontend/src/components/states/EmptyState.tsx": "Generic empty-state component displaying an icon, title, and description.",
  "frontend/src/components/states/ErrorState.tsx": "Error display component with message and optional retry button.",
  "frontend/src/components/states/LoadingState.tsx": "Loading spinner component with an optional message.",
  "frontend/src/components/vendor/LocationPicker.tsx": "Loads Leaflet dynamically and lets vendors set or update their map location with a draggable marker.",
  "frontend/src/components/vendor/MenuItemsEditor.tsx": "Provides UI to create, edit, and delete vendor menu items using mutation hooks.",
  "frontend/src/components/vendor/VendorDashboard.tsx": "Dashboard with tabbed navigation for editing vendor profile, menu, and location.",
  "frontend/src/components/vendor/VendorProfileForm.tsx": "Form for viewing and updating a vendor’s profile details via upsert mutation.",
  "frontend/src/hooks/mutations/useAuthMutations.ts": "Mutation hook for saving the logged‑in user's profile and invalidating related queries.",
  "frontend/src/hooks/mutations/useVendorMutations.ts": "Mutation hooks for updating vendor profiles and managing menu items with query invalidation.",
  "frontend/src/hooks/queries/useAuthProfile.ts": "Query hook for fetching the current user's profile using the actor API.",
  "frontend/src/hooks/queries/useVendors.ts": "Query hooks for listing vendors, fetching a vendor by ID, and getting the caller vendor profile.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and identity persistence.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive OKLCH color variables for light/dark themes and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, then renders App.",
  "frontend/src/pages/CustomerPortalPage.tsx": "Loads customer portal, showing a loader, auth gate, or the customer browse view depending on identity state.",
  "frontend/src/pages/LandingPage.tsx": "Implements the marketing landing page with hero, features, and navigation buttons for customer or vendor portals.",
  "frontend/src/pages/VendorPortalPage.tsx": "Loads vendor portal with loading state, auth gate, vendor gate, and vendor dashboard rendering.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read, persist, and clear URL parameters using URLSearchParams and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins matching the theme’s OKLCH variables.",
  "project_state.json": "Tracks overall project state, features, requirements, assets, and architectural notes for LocalBuddy."
}